backend/app/controllers/list_items_controller.rb

  def create
    list_item = ListItem.new(message: params[:message])
    user = User.find_by(id: params[:user_id])
    user.list.list_items << list_item
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
INSERT INTO "list_items" ("message", "created_at", "updated_at", "list_id") VALUES (?, ?, ?, ?)  [["message", "test note"], ["created_at", "2021-06-13 18:37:03.185758"], ["updated_at", "2021-06-13 18:37:03.185758"], ["list_id", 21]]

  def destroy
    binding.pry
    list_item = ListItem.find_by(id: params[:id])
    if list_item
      list_item.destroy
---
SELECT "list_items".* FROM "list_items" WHERE "list_items"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
DELETE FROM "list_items" WHERE "list_items"."id" = ?  [["id", 43]]