backend/app/controllers/users_controller.rb

  def create
    user = User.find_by(email: params[:email])
    if user
      render json: user, status: 200, message: "Successfully authenticated"
    else
      created_user = User.new(email: params[:email])
      new_list = List.new(title: 'My ToDo List')
      created_user.list = new_list
      new_list.save
      created_user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@gmail.com"], ["LIMIT", 1]]
INSERT INTO "lists" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "My ToDo List"], ["created_at", "2021-06-17 05:46:08.515865"], ["updated_at", "2021-06-17 05:46:08.515865"], ["user_id", 52]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "flatiron@gmail.com"], ["created_at", "2021-06-17 05:46:08.514229"], ["updated_at", "2021-06-17 05:46:08.514229"]]